The id of the newly duplicated ElementType.
  Namespace:   Autodesk.Revit.DB.Events
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public ElementId NewElementTypeId { get; }
  Visual Basic
Public ReadOnly Property NewElementTypeId As ElementId
	Get
  Visual C++
public:
property ElementId^ NewElementTypeId {
	ElementId^ get ();
}
 See Also
  ElementTypeDuplicatedEventArgs Class
  Autodesk.Revit.DB.Events Namespace